БухЭксп/Catalogs/CW_ВариантыСверткиТабличныхЧастей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВариантыСверткиТабличныхЧастей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СворачиватьПоГрузоперевозкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСверткиПоГрузоперевозкам</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСверткиПоГрузоперевозкамАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьИтогиПоГрузоперевозкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДополнительныеКолонки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НоменклатураСвертки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонАнглийский</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеСуммироватьКоличество</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммированиеКоличества</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВариантыСуммированияКоличества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиСвертки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимСверткиСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчитыватьЦенуПослеСвертки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СворачиватьПоДокументуРасходов</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЗамены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаменяемаяНоменклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаименованияДополнительныхКолонок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеКолонкиАнгл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиНаименований</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГоризонтальноеПоложение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШаблоныДополнительныхКолонок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиСвертки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиНаименований</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонАнглийский</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыСвертки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиСвертки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МониторинговыйПараметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ШаблоныУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ШаблоныУслуг</Name>
			<Comment>Шаблоны услуг для подстановки в документы клиентов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонАнглийский</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Comment>Договор либо приложение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасходнаяСтатья</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоходнаяСтатья</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВариантыСуммированияКоличества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВариантыСуммированияКоличества</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Суммировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Равно1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоГП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВариантыСверткиТабличныхЧастей/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	
	УстановитьВидимостьСтраницыДопКолонок();
	
	Если Объект.ВыводитьДополнительныеКолонки Тогда
		ДобавитьДополнительныеКолонки();
	КонецЕсли;
	
	ЗаполнитьЗначенияДополнительныхКолонок();
	
	УстановитьТекстШаблоновНаФорме();

	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстШаблоновНаФорме()
	
	Если ЗначениеЗаполнено(Объект.ШаблонСверткиПоГрузоперевозкам) Тогда
		ШаблонСверткиПоГрузоперевозкам = Объект.ШаблонСверткиПоГрузоперевозкам;
	Иначе
		ШаблонСверткиПоГрузоперевозкам = "<Укажите шаблон свертки>";
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ШаблонСверткиПоГрузоперевозкамАнгл) Тогда
		ШаблонСверткиПоГрузоперевозкамАнгл = Объект.ШаблонСверткиПоГрузоперевозкамАнгл;
	Иначе
		ШаблонСверткиПоГрузоперевозкамАнгл = "<Укажите шаблон свертки>";
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура НоменклатураСверткиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	//
	//Отказ = Истина;
	//// --- 
	//ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораНомеклатуры",ЭтотОбъект); 
	//ПФ = Новый Структура("Отбор,РежимВыбора",Новый Структура("Услуга",Истина),Истина);
	//ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПФ,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораНомеклатуры(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		// проверяем, что такой номенклатуры ещё нет
		Если НЕ _ПроверитьНоменклатуру(Ответ) Тогда
			
			_УФК.ВывестиПредупреждение("Такая номенклатура уже выбрана.");
			Возврат;
			
		Иначе
			
			Нстр = Объект.НоменклатураСвертки.Добавить();
			Нстр.Номенклатура = Ответ;
			
			Элементы.НоменклатураСвертки.ТекущаяСтрока = Нстр.ПолучитьИдентификатор();
			
			ЭтаФорма.Модифицированность=Истина;
			
			НоменклатураСверткиНоменклатураПриИзмененииНаСервере(Элементы.НоменклатураСвертки.ТекущаяСтрока);

		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _ПроверитьНоменклатуру(Номенклатура)
	// --- 
	
	Если _сф.к_НайтиСтроку(Объект.НоменклатураСвертки.Выгрузить(),"Номенклатура",Номенклатура) = Неопределено Тогда
		
		Возврат(Истина);
		
	Иначе
		
		Возврат(Ложь);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

&НаКлиенте
Процедура НоменклатураСверткиПриИзменении(Элемент)
	
	ПересчитатьИтогиПоТаблицам();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаменыПриИзменении(Элемент)
	
	ПересчитатьИтогиПоТаблицам();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогиПоТаблицам()
	
	Элементы.СтраницаШаблоны.Заголовок = "Шаблоны ("+Формат(Объект.НоменклатураСвертки.Количество(),"ЧЦ=10; ЧДЦ=; ЧН=")+")";
	Элементы.СтраницаПравилаЗамены.Заголовок = "Правила замены ("+Формат(Объект.ТаблицаЗамены.Количество(),"ЧЦ=10; ЧДЦ=; ЧН=")+")";
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ВыводитьДополнительныеКолонки Тогда
		ДобавитьДополнительныеКолонки();
	КонецЕсли;
	
	ЗаполнитьЗначенияДополнительныхКолонок();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Попытка 
		ДоговорПоГрузоперевозке = ВладелецФормы.Родитель.ДоговорПоГрузоперевозке;
	Исключение
	КонецПопытки;
	
	ПересчитатьИтогиПоТаблицам();
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

//---------------------------------------

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	
	Элементы.ШаблонСверткиПоГрузоперевозкам.Видимость = Объект.СворачиватьПоГрузоперевозкам;
	Элементы.ШаблонСверткиПоГрузоперевозкамАнгл.Видимость = Объект.СворачиватьПоГрузоперевозкам;
	Элементы.ВыводитьИтогиПоГрузоперевозкам.Видимость = Объект.СворачиватьПоГрузоперевозкам
	
КонецПроцедуры	

//---------------------------------------

&НаКлиенте
Процедура СворачиватьПоГрузоперевозкамПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
	Если Объект.СворачиватьПоГрузоперевозкам Тогда
		
		Объект.ВыводитьДополнительныеКолонки = Ложь;
		
		ОбработатьСбросФлагаДополнительныхКолонок();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСбросФлагаДополнительныхКолонок()
	
	УстановитьВидимостьСтраницыДопКолонок();
	ДобавитьДополнительныеКолонки(Ложь);
	
	Объект.НаименованияДополнительныхКолонок.Очистить();
	Объект.ШаблоныДополнительныхКолонок.Очистить();

КонецПроцедуры

//---------------------------------------

&НаКлиенте
Процедура ШаблонСверткиПоГрузоперевозкамНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизита", "ШаблонСверткиПоГрузоперевозкам");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияШаблонаЗавершение", ЭтотОбъект, ДополнительныеПараметры); 
	
	ПарамерыФормы = Новый Структура;
	ПарамерыФормы.Вставить("Шаблон",			Объект.ШаблонСверткиПоГрузоперевозкам);
	ПарамерыФормы.Вставить("РасходнаяСтатья",	Ложь);
	ПарамерыФормы.Вставить("ДоходнаяСтатья",	Истина);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПарамерыФормы,ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонСверткиПоГрузоперевозкамАнглНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизита", "ШаблонСверткиПоГрузоперевозкамАнгл");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияШаблонаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПарамерыФормы = Новый Структура;
	ПарамерыФормы.Вставить("Шаблон",			Объект.ШаблонСверткиПоГрузоперевозкамАнгл);
	ПарамерыФормы.Вставить("РасходнаяСтатья",	Ложь);
	ПарамерыФормы.Вставить("ДоходнаяСтатья",	Истина);
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов", ПарамерыФормы,ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияШаблонаЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	Конецесли;
	
	Модифицированность = Истина;
	
	Объект[ДополнительныеПараметры.ИмяРеквизита] = Результат;
	
	УстановитьТекстШаблоновНаФорме();

КонецПроцедуры





&НаСервере
Процедура НоменклатураСверткиНоменклатураПриИзмененииНаСервере(ИдентификаторСтроки)
	

	ТекущаяСтрока = Объект.НоменклатураСвертки.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура"				, ТекущаяСтрока.Номенклатура);
	ПараметрыОтбора.Вставить("ДоговорУказан"			, ЗначениеЗаполнено(ДоговорПоГрузоперевозке));
	ПараметрыОтбора.Вставить("ДоговорПоГрузоперевозке"	, ДоговорПоГрузоперевозке);
	ПараметрыОтбора.Вставить("ВидДоговора"				, ДоговорПоГрузоперевозке.ВидДоговора);

	ЗначениеВыборка = РегистрыСведений.CW_ШаблоныУслуг.ПолучитьШаблронУслуги(ПараметрыОтбора);
	
	Если ЗначениеВыборка <> Неопределено Тогда
		//Получаем первую строку
		
		ТекущаяСтрока.Шаблон 			= ЗначениеВыборка.Шаблон;
		ТекущаяСтрока.ШаблонАнглийский 	= ЗначениеВыборка.ШаблонАнглийский;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураСверткиНоменклатураПриИзменении(Элемент)
	НоменклатураСверткиНоменклатураПриИзмененииНаСервере(Элементы.НоменклатураСвертки.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если КонтрольДублированияОбщихШаблонов() Тогда
		Отказ = истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Указано более одного общего шаблона свертки номенклатуры!";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если КонтрольДублированияОбщихЗамен() Тогда
		Отказ = истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Указано более одного общего шаблона замены номенклатуры!";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если Отказ Тогда
		ПоказатьПредупреждение(, "Вариант свертки номенклатуры не записан!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КонтрольДублированияОбщихШаблонов()
	
	Отбор = Новый Структура("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	мСтроки = Объект.НоменклатураСвертки.НайтиСтроки(Отбор);
	Возврат мСтроки.Количество() > 1;
	
КонецФункции

&НаСервере
Функция КонтрольДублированияОбщихЗамен()
	
	Отбор = Новый Структура("ЗаменяемаяНоменклатура", Справочники.Номенклатура.ПустаяСсылка());
	мСтроки = Объект.ТаблицаЗамены.НайтиСтроки(Отбор);
	Возврат мСтроки.Количество() > 1;
	
КонецФункции

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры


#КонецОбласти

&НаКлиенте
Процедура НоменклатураСверткиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.НоменклатураСвертки.ТекущиеДанные;
		ТекущиеДанные.ИдентификаторСтрокиСвертки 	= Новый УникальныйИдентификатор;
		ТекущиеДанные.ПараметрыСвертки 				= ?(ТекущиеДанные.РежимСверткиСтроки = 0, Истина, Ложь);
		ТекущиеДанные.СуммированиеКоличества 		= ПредопределенноеЗначение("Перечисление.CW_ВариантыСуммированияКоличества.Суммировать");
		ТекущиеДанные.НеСуммироватьКоличество 		= Ложь;
		ТекущиеДанные.РасчитыватьЦенуПослеСвертки 	= Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьДополнительныеКолонкиПриИзменении(Элемент)
	
	Если Не Объект.ВыводитьДополнительныеКолонки Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаДополнительныеКолонки", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, "Все настроенные шаблоны для дополнительных колонок будут удалены. Продоложить?", Режим, 0);	
		
	Иначе
		
		ЗаполнитьИдентифкаторыДляДополнительныхКолонок();
		Объект.СворачиватьПоГрузоперевозкам = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИдентифкаторыДляДополнительныхКолонок()

	Для Каждого СтрокаШабонов из Объект.НоменклатураСвертки Цикл
		СтрокаШабонов.ИдентификаторСтрокиСвертки = Новый УникальныйИдентификатор;
	КонецЦикла;
	
	УстановитьВидимостьСтраницыДопКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаДополнительныеКолонки(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Объект.ВыводитьДополнительныеКолонки = Истина;
		Возврат;
	КонецЕсли;
	
	ОбработатьСбросФлагаДополнительныхКолонок();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраницыДопКолонок()
	
	Элементы.СтраницаДополнительныеКолонки.Видимость = Объект.ВыводитьДополнительныеКолонки;
	
КонецПроцедуры


&НаСервере
Процедура ДобавитьДополнительныеКолонки(ДобавитьКолонки = Истина)
	
	ДобавленныеРеквизиты 	= Новый Массив;
	УдаляемыеРеквизиты 		= Новый Массив;
	Для Каждого СтрокаДопКолонок из Объект.НаименованияДополнительныхКолонок Цикл
		
		ИдентфикаторСтроки = СтрЗаменить(Строка(СтрокаДопКолонок.ИдентификаторСтрокиНаименований),"-","_");
		
		ИмяРеквизитаРус  = "Рус_" + ИдентфикаторСтроки;
		
		НайденныйРеквизит = ЭтаФорма.Элементы.Найти(ИмяРеквизитаРус); 
		Если НайденныйРеквизит <> Неопределено Тогда
			УдаляемыеРеквизиты.Добавить(НайденныйРеквизит.ПутьКДанным);
		КонецЕсли;
		
		Если ДобавитьКолонки Тогда
			НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаРус, Новый ОписаниеТипов("Строка"), "Объект.НоменклатураСвертки",,Ложь);      
			НовыйРеквизит.Заголовок 		= СтрокаДопКолонок.НаименованиеКолонки+"(рус)";
			НовыйРеквизит.СохраняемыеДанные = истина;
			
			ДобавленныеРеквизиты.Добавить(НовыйРеквизит); 
		КонецЕсли;
		
		ИмяРеквизитаАнгл 	= "Англ_" + ИдентфикаторСтроки;   
		НайденныйРеквизит = ЭтаФорма.Элементы.Найти(ИмяРеквизитаАнгл); 
		Если НайденныйРеквизит <> Неопределено Тогда
			УдаляемыеРеквизиты.Добавить(НайденныйРеквизит.ПутьКДанным);
		КонецЕсли;
		
		Если  ДобавитьКолонки Тогда
			НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизитаАнгл, Новый ОписаниеТипов("Строка"), "Объект.НоменклатураСвертки",,Ложь);      
			НовыйРеквизит.Заголовок 		= СтрокаДопКолонок.НаименованиеКолонки+"(англ)";
			НовыйРеквизит.СохраняемыеДанные = истина;
			
			ДобавленныеРеквизиты.Добавить(НовыйРеквизит); 
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавленныеРеквизиты, УдаляемыеРеквизиты);
	
	Если Не ДобавитьКолонки Тогда
		Возврат;
	КонецЕсли;
	
	//Общая группа
	ОбщаяГруппа = ЭтаФорма.Элементы.Найти("НоменклатураСверткиГруппаОбщаяГруппаДополнительныеКолонки");
	Если ОбщаяГруппа = Неопределено Тогда
		ОбщаяГруппа = ЭтаФорма.Элементы.Добавить("НоменклатураСверткиГруппаОбщаяГруппаДополнительныеКолонки", Тип("ГруппаФормы"), ЭтаФорма.Элементы.НоменклатураСвертки);
		ОбщаяГруппа.Вид 				= ВидГруппыФормы.ГруппаКолонок;
		ОбщаяГруппа.Заголовок 			= "Дополнительные колонки";
		ОбщаяГруппа.ОтображатьВШапке 	= Истина;
		ОбщаяГруппа.Группировка = ГруппировкаКолонок.Горизонтальная;
	КонецЕсли;
	
	Для Каждого СтрокаДопКолонок из Объект.НаименованияДополнительныхКолонок Цикл
		
		ИдентфикаторСтроки = СтрЗаменить(Строка(СтрокаДопКолонок.ИдентификаторСтрокиНаименований),"-","_");
		
		ИмяРеквизитаРус 	= "Рус_"  + ИдентфикаторСтроки;
		ИмяРеквизитаАнгл 	= "Англ_" + ИдентфикаторСтроки;
		
		ИмяГруппы = "НоменклатураСверткиГруппаДополнительныеКолонки"+ИдентфикаторСтроки;
		
		Группа = ЭтаФорма.Элементы.Найти(ИмяГруппы);
		Если Группа = Неопределено Тогда
			Группа = ЭтаФорма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ОбщаяГруппа);
			Группа.Вид 				= ВидГруппыФормы.ГруппаКолонок;
			Группа.Заголовок 		= СтрокаДопКолонок.НаименованиеКолонки;
			Группа.ОтображатьВШапке = Истина;
			Группа.Группировка 		= ГруппировкаКолонок.Вертикальная; 
		Иначе
			Группа.Заголовок 		= СтрокаДопКолонок.НаименованиеКолонки;
		КонецЕсли;
		
		НоваяКолонка = ЭтаФорма.Элементы.Найти(ИмяРеквизитаРус);
		Если НоваяКолонка <> Неопределено Тогда
			ЭтаФорма.Элементы.Удалить(НоваяКолонка);
		КонецЕсли;
		НоваяКолонка           	 = ЭтаФорма.Элементы.Добавить(ИмяРеквизитаРус, Тип("ПолеФормы"), Группа);
		НоваяКолонка.Вид      	 = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ПутьКДанным = "Объект.НоменклатураСвертки."+ИмяРеквизитаРус;
		НоваяКолонка.УстановитьДействие("НачалоВыбора", "НачалоВыбораШабонаДополнитеьнойКолонки");
		НоваяКолонка.ОтображатьВШапке 	= Ложь;
		НоваяКолонка.МногострочныйРежим = Истина;
		НоваяКолонка.КнопкаВыбора 		= Истина;
		НоваяКолонка.АвтоМаксимальнаяВысота 	= Ложь;
		НоваяКолонка.МаксимальнаяВысота 		= 1;
		
		НоваяКолонка = ЭтаФорма.Элементы.Найти(ИмяРеквизитаАнгл);
		Если НоваяКолонка <> Неопределено Тогда
			ЭтаФорма.Элементы.Удалить(НоваяКолонка);
		КонецЕсли;
		НоваяКолонка           	 = ЭтаФорма.Элементы.Добавить(ИмяРеквизитаАнгл, Тип("ПолеФормы"), Группа);
		НоваяКолонка.Вид      	 = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ПутьКДанным = "Объект.НоменклатураСвертки."+ИмяРеквизитаАнгл;
		НоваяКолонка.УстановитьДействие("НачалоВыбора", "НачалоВыбораШабонаДополнитеьнойКолонки");
		НоваяКолонка.ОтображатьВШапке 	= Ложь;
		НоваяКолонка.МногострочныйРежим = Истина;
		НоваяКолонка.КнопкаВыбора 		= Истина;
		НоваяКолонка.АвтоМаксимальнаяВысота 	= Ложь;
		НоваяКолонка.МаксимальнаяВысота 		= 1;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораШабонаДополнитеьнойКолонки(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияШаблонаДополнительныхКолонок",ЭтотОбъект, Элемент.Имя); 
	ПараметрыФормы = Новый Структура("Шаблон, РасходнаяСтатья, ДоходнаяСтатья",Элемент.ТекстРедактирования, Ложь, Истина);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов",ПараметрыФормы,Элемент,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияШаблонаДополнительныхКолонок(Ответ, ИмяРеквизита) Экспорт 
	
	Если Ответ <> Неопределено Тогда
		Элементы.НоменклатураСвертки.ТекущиеДанные[ИмяРеквизита] = Ответ;
		Модифицированность = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ВыводитьДополнительныеКолонки Тогда
		
		ТекущийОбъект.ШаблоныДополнительныхКолонок.Очистить();
		
		Для Каждого СтрокаНоменклатуры из Объект.НоменклатураСвертки Цикл
			
			Для Каждого СтрокаДопКолонок из Объект.НаименованияДополнительныхКолонок Цикл
				
				ИдентфикаторСтроки = СтрЗаменить(Строка(СтрокаДопКолонок.ИдентификаторСтрокиНаименований),"-","_");
				
				ИмяРеквизитаРус 	= "Рус_"  + ИдентфикаторСтроки;
				ИмяРеквизитаАнгл 	= "Англ_" + ИдентфикаторСтроки;
				
				НоваяСтрока = ТекущийОбъект.ШаблоныДополнительныхКолонок.Добавить();
				НоваяСтрока.ИдентификаторСтрокиСвертки 		= СтрокаНоменклатуры.ИдентификаторСтрокиСвертки;
				НоваяСтрока.ИдентификаторСтрокиНаименований	= СтрокаДопКолонок.ИдентификаторСтрокиНаименований;
				НоваяСтрока.Шаблон 				= СтрокаНоменклатуры[ИмяРеквизитаРус];
				НоваяСтрока.ШаблонАнглийский 	= СтрокаНоменклатуры[ИмяРеквизитаАнгл];
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли; 
	
	ПроверитьУникальностьЗаменяемойНоменклатуры(Отказ);
	
	УдалитьНеиспользуемыеПараметрыСвертки(ТекущийОбъект);

КонецПроцедуры

&НаСервере
Процедура УдалитьНеиспользуемыеПараметрыСвертки(ТекущийОбъект)
	
	Отбор = Новый Структура;
	Отбор.Вставить("РежимСверткиСтроки", 1);
	
	мСтрокиКонтроля = Объект.НоменклатураСвертки.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаКонтроля из мСтрокиКонтроля Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ИдентификаторСтрокиСвертки",СтрокаКонтроля.ИдентификаторСтрокиСвертки); 
		
		мСтроки = ТекущийОбъект.ПараметрыСвертки.НайтиСтроки(СтруктураОтбора);
		Для Каждого Строка из мСтроки Цикл
			ТекущийОбъект.ПараметрыСвертки.Удалить(Строка);
		КонецЦикла;
	КонецЦикла
	

КонецПроцедуры

&НаСервере
Процедура ПроверитьУникальностьЗаменяемойНоменклатуры(Отказ)
	
	ВремТаблицаЗамены = Объект.ТаблицаЗамены.Выгрузить().Скопировать();
	ВремТаблицаЗамены.Свернуть("ЗаменяемаяНоменклатура");
	
	Если ВремТаблицаЗамены.Количество() <> Объект.ТаблицаЗамены.Количество() Тогда
		
		Для Каждого СтрокаВрем из ВремТаблицаЗамены Цикл
			
			Параметрыотбора = Новый Структура;
			Параметрыотбора.Вставить("ЗаменяемаяНоменклатура", СтрокаВрем.ЗаменяемаяНоменклатура);
			мСтроки = Объект.ТаблицаЗамены.НайтиСтроки(Параметрыотбора);
			
			Если мСтроки.Количество() > 1 Тогда
				
				ПерваяИзНайденных = мСтроки[0];
				
				Индекс 	= Объект.ТаблицаЗамены.Индекс(ПерваяИзНайденных);
				Поле 	= "ТаблицаЗамены["+Индекс+"].ЗаменяемаяНоменклатура";
				
				мНомераСтрок = Новый Массив;
				Для Каждого СтрокаМассива из мСтроки Цикл
					ИндексСтроки 	= Объект.ТаблицаЗамены.Индекс(СтрокаМассива);
					мНомераСтрок.Добавить(ИндексСтроки+1);
				КонецЦикла;
				
				СтрокаНомеров = СтрСоединить(мНомераСтрок,", ");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дублирование номенклатуры (строки: "+СтрокаНомеров+")",,Поле,"Объект", Отказ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияДополнительныхКолонок()
	
	Для Каждого СтрокаНоменклатуры из Объект.НоменклатураСвертки Цикл
		
		Если Объект.ВыводитьДополнительныеКолонки Тогда
			Для Каждого СтрокаДопКолонок из Объект.НаименованияДополнительныхКолонок Цикл
				
				ИдентфикаторСтроки = СтрЗаменить(Строка(СтрокаДопКолонок.ИдентификаторСтрокиНаименований),"-","_");
				
				ИмяРеквизитаРус 	= "Рус_"  + ИдентфикаторСтроки;
				ИмяРеквизитаАнгл 	= "Англ_" + ИдентфикаторСтроки;
				
				мСтроки = Объект.ШаблоныДополнительныхКолонок.НайтиСтроки(новый Структура("ИдентификаторСтрокиНаименований, ИдентификаторСтрокиСвертки", СтрокаДопКолонок.ИдентификаторСтрокиНаименований, СтрокаНоменклатуры.ИдентификаторСтрокиСвертки));
				Если мСтроки.Количество() > 0 Тогда
					СтрокаНоменклатуры[ИмяРеквизитаРус] = мСтроки[0].Шаблон;
					СтрокаНоменклатуры[ИмяРеквизитаАнгл] = мСтроки[0].ШаблонАнглийский;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		УстановитьНадписьГипрессылкиНастройки(СтрокаНоменклатуры);
		
		СтрокаНоменклатуры.стрШаблонРусский 	= СтрокаНоменклатуры.Шаблон;
		СтрокаНоменклатуры.стрШаблонАнглийский 	= СтрокаНоменклатуры.ШаблонАнглийский;
		
		

		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованияДополнительныхКолонокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Объект.ВыводитьДополнительныеКолонки Тогда
		ДобавитьДополнительныеКолонки();
		ЗаполнитьЗначенияДополнительныхКолонок();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованияДополнительныхКолонокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока и Объект.ВыводитьДополнительныеКолонки Тогда
		ТекущиеДанные = Элементы.НаименованияДополнительныхКолонок.ТекущиеДанные;
		ТекущиеДанные.ШиринаКолонки = 10;
		ТекущиеДанные.ГоризонтальноеПоложение = "Авто";
		ТекущиеДанные.ИдентификаторСтрокиНаименований = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаменыЗаменяемаяНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ТаблицаЗамены.ТекущаяСтрока;
	
	Если Не ПроверитьУниальность(ВыбранноеЗначение) Тогда
		Оповещение = новый ОписаниеОповещения("УдалитьСтрокуЗамены", ЭтотОбъект, ТекущаяСтрока);
		ПоказатьПредупреждение(Оповещение,"Номенклатура """+Строка(ВыбранноеЗначение)+""" уже есть в списке!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуЗамены(ТекущаяСтрока) Экспорт
	
	УдалитьСтрокуНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокуНаСервере(ТекущаяСтрока)
	
	СтрокаТекущая = Объект.ТаблицаЗамены.НайтиПоИдентификатору(ТекущаяСтрока);
	Объект.ТаблицаЗамены.Удалить(Объект.ТаблицаЗамены.Индекс(СтрокаТекущая));
	
КонецПроцедуры

&НаСервере
Функция ПроверитьУниальность(ВыбранноеЗначение)
	
	ПараметрыОтбора = Новый	Структура;
	ПараметрыОтбора.Вставить("ЗаменяемаяНоменклатура",ВыбранноеЗначение); 
	
	мСтроки = Объект.ТаблицаЗамены.НайтиСтроки(ПараметрыОтбора);
	
	Возврат мСтроки.Количество() = 0;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаЗаменыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
		ТекущиеДанные = Элементы.ТаблицаЗамены.ТекущиеДанные;
		
		НоваяСтрока = Объект.ТаблицаЗамены.Добавить();
		НоваяСтрока.Номенклатура = ТекущиеДанные.Номенклатура;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНадписьГипрессылкиНастройки(СтрокаТекущая)
	
	СтрокаТекущая.ПараметрыСвертки = ?(СтрокаТекущая.РежимСверткиСтроки = 0, Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураСверткиРежимСверткиСтрокиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.НоменклатураСвертки.ТекущаяСтрока;
	НоменклатураСверткиРежимСверткиСтрокиПриИзмененииНаСервере(ТекущаяСтрока);	
	
КонецПроцедуры

&НаСервере
Процедура НоменклатураСверткиРежимСверткиСтрокиПриИзмененииНаСервере(ТекущаяСтрока)
	
	СтрокаТекущая = Объект.НоменклатураСвертки.НайтиПоИдентификатору(ТекущаяСтрока);
	УстановитьНадписьГипрессылкиНастройки(СтрокаТекущая);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеТекущейСтроки(ВыбраннаяСтрока)
	
	СтрокаСвертки = Объект.НоменклатураСвертки.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	мПараметры = Новый Массив;
	
	СтруктураОтбора = новый Структура;
	СтруктураОтбора.Вставить("ИдентификаторСтрокиСвертки", СтрокаСвертки.ИдентификаторСтрокиСвертки);
	мСтроки = Объект.ПараметрыСвертки.НайтиСтроки(СтруктураОтбора);
	
	Для Каждого НайденнаяСтрока из мСтроки Цикл
		мПараметры.Добавить(НайденнаяСтрока.МониторинговыйПараметр);
	КонецЦикла;
	
	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("АдресВыбранныеКолонки", ПоместитьВоВременноеХранилище(мПараметры, УникальныйИдентификатор));
	ДанныеСтроки.Вставить("СуммированиеКоличества", СтрокаСвертки.СуммированиеКоличества);
	ДанныеСтроки.Вставить("РасчитыватьЦенуПослеСвертки", СтрокаСвертки.РасчитыватьЦенуПослеСвертки);
	ДанныеСтроки.Вставить("СворачиватьПоДокументуРасходов", СтрокаСвертки.СворачиватьПоДокументуРасходов);

	Возврат ДанныеСтроки;
	
КонецФункции

&НаСервере
Функция ПолучитьШаблоныТекущейСтроки(ВыбраннаяСтрока, ИмяРеквизита)
	
	СтрокаСвертки = Объект.НоменклатураСвертки.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Возврат СтрокаСвертки[ИмяРеквизита];
	
КонецФункции


&НаКлиенте
Процедура НоменклатураСверткиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.ГиперссылкаЯчейки Тогда
		СтандартнаяОбработка 	= Ложь;
		Модифицированность 		= Истина;
		
		Если Поле.Имя = "НоменклатураСверткиПараметрыСвертки" Тогда
			ДанныеСтроки = ПолучитьДанныеТекущейСтроки(ВыбраннаяСтрока);
			
			Оповещение = Новый ОписаниеОповещения("ОбработатьВыборКолонок", ЭтаФорма, ВыбраннаяСтрока);
			
			ПараметрыФормыВыбора = Новый Структура;
			ПараметрыФормыВыбора.Вставить("АдресВыбранныеКолонки", 			ДанныеСтроки.АдресВыбранныеКолонки);
			ПараметрыФормыВыбора.Вставить("СуммированиеКоличества",			ДанныеСтроки.СуммированиеКоличества);
			ПараметрыФормыВыбора.Вставить("РасчитыватьЦенуПослеСвертки", 	ДанныеСтроки.РасчитыватьЦенуПослеСвертки);
			ПараметрыФормыВыбора.Вставить("СворачиватьПоДокументуРасходов", ДанныеСтроки.СворачиватьПоДокументуРасходов);
			
			ОткрытьФорму("Справочник.CW_ВариантыСверткиТабличныхЧастей.Форма.ФормаПараметровСверкти", ПараметрыФормыВыбора, ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		ИначеЕсли Поле.Имя = "НоменклатураСверткистрШаблонРусский" или 
			Поле.Имя = "НоменклатураСверткистрШаблонАнглийский"  Тогда
			
			Если Поле.Имя = "НоменклатураСверткистрШаблонРусский" Тогда 
				ИмяРеквизита 	= "Шаблон";
				РеквизитФормы 	= "стрШаблонРусский";
			КонецЕсли;
			Если Поле.Имя = "НоменклатураСверткистрШаблонАнглийский"  Тогда
				ИмяРеквизита 	= "ШаблонАнглийский";
				РеквизитФормы 	= "стрШаблонАнглийский";
			КонецЕсли;
			
			Шаблон = ПолучитьШаблоныТекущейСтроки(ВыбраннаяСтрока, ИмяРеквизита);
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
			ДополнительныеПараметры.Вставить("РеквизитОбъекта", ИмяРеквизита);
			ДополнительныеПараметры.Вставить("РеквизитФормы", 	РеквизитФормы);

			Оповещение = Новый ОписаниеОповещения("ОбработкаИзмененияШаблона",ЭтотОбъект, ДополнительныеПараметры); 
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Шаблон", 			Шаблон);
			ПараметрыФормы.Вставить("РасходнаяСтатья", 	Ложь);
			ПараметрыФормы.Вставить("ДоходнаяСтатья", 	Истина);
			
			ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов",ПараметрыФормы,ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияШаблона(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаИзмененияШаблонаНаСервере(Результат, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаИзмененияШаблонаНаСервере(Знач Результат, Знач ДополнительныеПараметры)
	
	СтрокаСвертки = Объект.НоменклатураСвертки.НайтиПоИдентификатору(ДополнительныеПараметры.ВыбраннаяСтрока);

	СтрокаСвертки[ДополнительныеПараметры.РеквизитОбъекта] = Результат;
	СтрокаСвертки[ДополнительныеПараметры.РеквизитФормы] 	= Результат;

КонецПроцедуры


&НаКлиенте
Процедура ОбработатьВыборКолонок(РезультатВыбора, ВыбраннаяСтрока) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьВыборКолонокНаСервере(РезультатВыбора, ВыбраннаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборКолонокНаСервере(РезультатВыбора, ВыбраннаяСтрока)
	
	СтрокаТекущая = Объект.НоменклатураСвертки.НайтиПоИдентификатору(ВыбраннаяСтрока); 
	
	СтрокаТекущая.РасчитыватьЦенуПослеСвертки 	 = РезультатВыбора.РасчитыватьЦенуПослеСвертки;
	СтрокаТекущая.СуммированиеКоличества 		 = РезультатВыбора.СуммированиеКоличества;
	СтрокаТекущая.СворачиватьПоДокументуРасходов = РезультатВыбора.СворачиватьПоДокументуРасходов;
	
	СтруктураОтбора = новый Структура;
	СтруктураОтбора.Вставить("ИдентификаторСтрокиСвертки", 	СтрокаТекущая.ИдентификаторСтрокиСвертки);
	мСтрокиПараметровСвертки = Объект.ПараметрыСвертки.НайтиСтроки(СтруктураОтбора);
	
	Для Каждого СтрокаПараметровСвертки из мСтрокиПараметровСвертки Цикл
		Объект.ПараметрыСвертки.Удалить(СтрокаПараметровСвертки);
	КонецЦикла;
	
	Для Каждого МониторинговыйПараметр из РезультатВыбора.Параметры Цикл
		НоваяСтрока = Объект.ПараметрыСвертки.Добавить();
		НоваяСтрока.МониторинговыйПараметр = МониторинговыйПараметр;
		НоваяСтрока.ИдентификаторСтрокиСвертки = СтрокаТекущая.ИдентификаторСтрокиСвертки;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураСверткиПередУдалением(Элемент, Отказ)
	НоменклатураСверткиПередУдалениемНаСервере(Элементы.НоменклатураСвертки.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура НоменклатураСверткиПередУдалениемНаСервере(ИдентификаторСтроки)
	
	УдаляемаяСтрока = Объект.НоменклатураСвертки.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторСтрокиСвертки",УдаляемаяСтрока.ИдентификаторСтрокиСвертки); 
	
	мСтроки = Объект.ШаблоныДополнительныхКолонок.НайтиСтроки(Отбор);
	Для Каждого Строка из мСтроки Цикл
		Объект.ШаблоныДополнительныхКолонок.Удалить(Строка);
	КонецЦикла;
	
	мСтроки = Объект.ПараметрыСвертки.НайтиСтроки(Отбор);
	Для Каждого Строка из мСтроки Цикл
		Объект.ПараметрыСвертки.Удалить(Строка);
	КонецЦикла;
	
КонецПроцедуры
